    // Функция ymaps.ready() будет вызвана, когда
    // загрузятся все компоненты API, а также когда будет готово DOM-дерево.
    ymaps.ready(init);

    function init() {
        // Создание карты.
        // https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/map-docpage/
        var myMap = new ymaps.Map("map", {
            // Координаты центра карты.
            // Порядок по умолчнию: «широта, долгота».
            center: [52.58613397100726, 39.58826071120778],
            // Уровень масштабирования. Допустимые значения:
            // от 0 (весь мир) до 19.
            zoom: 11,

            //тип карты  - 'yandex#satellite' - 'yandex#hybrid' - 'yandex#publicMap'
            type: 'yandex#publicMap',

            // Элементы управления
            // https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/controls/standard-docpage/
            controls: [
                //'zoomControl', // Ползунок масштаба
                'rulerControl', // Линейка
                //'routeButtonControl', // Панель маршрутизации
                //'trafficControl', // Пробки
                'typeSelector' // Переключатель слоев карты
                //'fullscreenControl' // Полноэкранный режим
            ]
        });

        // Добавление метки
        // https://tech.yandex.ru/maps/doc/jsapi/2.1/ref/reference/Placemark-docpage/
        // var myPlacemark = new ymaps.Placemark([55.76, 37.64], {
        //     // Хинт показывается при наведении мышкой на иконку метки.
        //     hintContent: 'Содержимое всплывающей подсказки',
        //     // Балун откроется при клике по метке.
        //     balloonContent: 'Содержимое балуна'
        // });
        // var myPlacemark = new ymaps.Placemark([55.76, 37.64], {
        //     hasBalloon: false,
        //     href: 'http://localhost:8080/districts/1'
        //});
        // myPlacemark.events.add('click', function (e) {
        // location = e.get('target').options.get('href');
        //});

        // После того как метка была создана, добавляем её на карту.
        //myMap.geoObjects.add(myPlacemark);


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

    //     // Создаем многоугольник, используя класс GeoObject.
    // var myGeoObject = new ymaps.GeoObject({
    //     // Описываем геометрию геообъекта.
    //     geometry: {
    //         // Тип геометрии - "Многоугольник".
    //         type: "Polygon",
    //         // Указываем координаты вершин многоугольника.
    //         coordinates: [
    //             // Координаты вершин внешнего контура.
    //             [
    //                 [55.75, 37.80],
    //                 [55.80, 37.90],
    //                 [55.75, 38.00],
    //                 [55.70, 38.00],
    //                 [55.70, 37.80]
    //             ],
    //             // Координаты вершин внутреннего контура.
    //             [
    //                 [55.75, 37.82],
    //                 [55.75, 37.98],
    //                 [55.65, 37.90]
    //             ]
    //         ],
    //         // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
    //         fillRule: "nonZero"
    //     },
    //     // Описываем свойства геообъекта.
    //     properties:{
    //         // Содержимое балуна.
    //         balloonContent: "Многоугольник"
    //     }
    // },

    // {
    //     // Описываем опции геообъекта.
    //     // Цвет заливки.
    //     fillColor: '#00FF00',
    //     // Цвет обводки.
    //     strokeColor: '#0000FF',
    //     // Общая прозрачность (как для заливки, так и для обводки).
    //     opacity: 0.5,
    //     // Ширина обводки.
    //     strokeWidth: 5,
    //     // Стиль обводки.
    //     strokeStyle: 'shortdash'
    // });

    // // Добавляем многоугольник на карту.
    // myMap.geoObjects.add(myGeoObject);



    // Создаем многоугольник, используя вспомогательный класс Polygon.
//    var sovietDistrict = new ymaps.Polygon([
//        // Указываем координаты вершин многоугольника.
//        [
//            [51.66608372686424, 39.178028012477924],
//            [51.66715488640029, 39.17453956566809],
//            [51.66694773098041, 39.17324249944738],
//            [51.67619592595975, 39.1412806529951],
//            [51.68391560403649, 39.118697602337285],
//            [51.68965205857361, 39.10319714045619],
//            [51.69596053854517, 39.08767880509613],//upper line
//            [51.697413440574934, 39.08803316847567],
//            [51.69806301110756, 39.09107467482102],
//            [51.69919634764937, 39.090216393498395],
//            [51.700688144777914, 39.09278199956691],
//            [51.705012380042135, 39.082157195371366],
//            [51.7121922494136, 39.07918966532096],
//            [51.715020747950085, 39.0741458257984],
//            [51.71121077764035, 39.06630570534135],
//            [51.705591571959665, 39.06332259939364],
//            [51.70028347776193, 39.05354952952713],
//            [51.68482007935468, 39.047624459121664],
//            [51.67078862462346, 39.070692078788866],
//            [51.66444224304419, 39.071303824181236],
//            [51.6484836697393, 39.06801203262691],
//            [51.63923227198305, 39.07577839164395],
//            [51.63650185479701, 39.07577786329898],
//            [51.62878828038578, 39.06636793496559],
//            [51.61805221076508, 39.044738759650976],
//            [51.612512665331046, 39.02507425429686],
//            [51.60276240373747, 39.01408807253025],
//            [51.59394803620035, 39.01314366226566],
//            [51.56990570870572, 39.02658682496897],
//            [51.544536788868655, 39.06483237109996],
//            [51.543322293711576, 39.078124560023994],
//            [51.538368985711614, 39.08626262988196],
//            [51.52740932049214, 39.08684273752343],
//            [51.5272135141838, 39.09179437755641],
//            [51.53190472723964, 39.09228304715732],
//            [51.53636996244685, 39.10062179466169],
//            [51.53880850195509, 39.10204272563841],
//            [51.54338263287486, 39.13682148180728],
//            [51.56277857782081, 39.19805560004887],
//            [51.58692953531985, 39.201848448993054],
//            [51.615072116903846, 39.20416251056879],
//            [51.617077372073936, 39.18931574496728],
//            [51.62148887429033, 39.18049060165973],
//            [51.619831841831925, 39.172369791694464],
//            [51.624304507283675, 39.171905715401444],
//            [51.628501385990695, 39.16367447682715],
//            [51.62973809846588, 39.16460906185804],
//            [51.63261073615333, 39.156670276349445],
//            [51.63280737434904, 39.147448757766234],
//            [51.63585823650339, 39.140310289707514],
//            [51.63798128795897, 39.140367844486256],
//            [51.64486775715204, 39.14854208384694],
//            [51.64517914783651, 39.14967692943824],
//            [51.64366770874346, 39.15306364472244],
//            [51.645287895684206, 39.15483903553192],
//            [51.64757635866729, 39.156043368583205],
//            [51.65023177969284, 39.16342914608552],
//            [51.6497220934382, 39.16507384695353],
//            [51.647400162790916, 39.17005914658993],
//            [51.64843013528288, 39.17172811139804],
//            [51.649524909984784, 39.174208818046296],
//            [51.65201736793672, 39.17889679128585],
//            [51.654653985045954, 39.17668002793671],
//            [51.655236616258705, 39.17839341685624],
//            [51.66331372717466, 39.17111165234239],
//            [51.66604964885775, 39.178090553585875]
//         ]
//    ], {
//        hasBalloon: false,
//        hintContent: 'Советский район'
//    }, {
//        // Задаем опции геообъекта.
//        // Цвет заливки.
//        fillColor: '#00FF0020',
//                // Ширина обводки.
//                strokeWidth: 1
//    });
//
//    sovietDistrict.events.add('click', function (e) {
//        window.location = "http://localhost:8080/districts/1";
//        });
//
//
//    // Добавляем многоугольник на карту.
//    myMap.geoObjects.add(sovietDistrict);

    }